{
  "content": [
    "Slope Repair Requests (SRR) are a key component of the Term Contract for the Maintenance of Slopes for which the Architectural Services Department (Property Services Branch) is responsible.",
    "Here's a comprehensive overview of SRR:",
    "1. Definition and Scope",
    "• SRR stands for Slope Repair Request.",
    "• It encompasses defects identified in slopes that require attention, often arising outside of routine inspections.",
    "• The handling of SRRs is integrated with Routine Maintenance Inspections (RMI) and Routine Maintenance Works (RMW).",
    "• Common types of SRRs include, but are not limited to, debris removal, grass cutting, drain blockage, removal of dead or fallen trees and/or hazardous tree/branch, removal of loose boulders, and repair of defective slope surfaces.",
    "2. Initiation and Sources of SRR SRRs can come to the Contractor's notice through various channels:",
    "• Referrals of complaints from the public via the 1823 complaint hotline.",
    "• Inspections conducted by the Service Manager.",
    "• Reports from third parties, the Contractor's own staff, or other Government departments.",
    "• Emergency cases, such as those occurring after typhoons, rainstorms, and other inclement weather conditions.",
    "3. Contractor's Responsibilities and Management",
    "• The Contractor is required to set up an SRR team responsible for dealing with all SRR cases during normal working hours, bearing their own costs for this team.",
    "• During normal working hours, this dedicated SRR team handles emergencies related to slopes.",
    "• For Out of Normal Working Hours Emergencies, the Contractor must provide a separate emergency service, with personnel like a Tree Work Supervisor (TWS) or Arborist attending vegetation-related matters.",
    "• The team must be adequately manned and equipped.",
    "• The Contractor must scrutinise each SRR upon receipt, as some cases may be wrong referrals irrelevant to the ArchSD Slopes. If a request is outside ArchSD's purview, the SRR investigation report must identify the responsible government department or private entity for referral.",
    "• The Contractor should maintain sufficient stock of common parts and materials in its own store to facilitate minor repair works and ensure timely completion of SRRs. Claims for extension of time due to ordering parts or materials will not be considered unless a compensation event arises.",
    "4. Personnel Involved in SRR Handling",
    "• A Maintenance Support Officer (MSO) is required to coordinate daily SRRs between complainants/enquirers, ArchSD, and the Contractor, and handle other administrative tasks.",
    "• The Project Manager is responsible for investigating SRR cases involving landslides or slope safety concerns. They also inspect serious defects like leakage signs, widening cracks, spalling concrete, erosion, or abnormal tree conditions, and report them immediately to the Service Manager.",
    "• Slope Inspectors and/or Tree Work Supervisors investigate other SRR cases.",
    "• A senior Arborist investigates SRR cases involving tree failure incidents and prepares the Tree Failure Report Form.",
    "5. SRR Process and Completion Times The Contractor must investigate all SRR cases and submit SRR investigation reports with photos demonstrating case details according to the following completion times:",
    "• Emergency Category:",
    "◦ 1-hour response time.",
    "◦ Submission of SRR investigation (SRRI) report within 24 hours.",
    "• Urgent Category:",
    "◦ Attendance and temporary mitigation within 48 hours.",
    "◦ Submission of SRRI report with recommended mitigation measures within 72 hours.",
    "◦ Completion of mitigation measures not requiring Service Manager's acceptance within 14 days, OR obtainment of acceptance for mitigation measures requiring Service Manager's acceptance within 20 days.",
    "• General Category:",
    "◦ Attendance and temporary mitigation within 5 days.",
    "◦ Submission of SRRI report with recommended mitigation measures within 7 days.",
    "◦ Completion of mitigation measures not requiring Service Manager's acceptance within 30 days, OR obtainment of acceptance for mitigation measures requiring Service Manager's acceptance within 40 days.",
    "• For simple and straightforward SRR cases (e.g., debris removal, drain blockage) that can be completed within half a day, the works should be finished on the same day of investigation, with completion photos submitted in the report.",
    "6. Reporting and Documentation",
    "• The SRR team is responsible for confirming the date and time for SRR execution within 15 minutes of receipt, monitoring progress, and reporting completion.",
    "• An SRR Completion Report must be submitted within 1 working day of completion. This report should be signed by the Slope Inspector and endorsed by the Project Manager.",
    "• SRR investigation reports must include the time of interim reply to the complainant and the reply content.",
    "• SRR completion reports must include the time of final reply to the complainant and the reply content, along with photos highlighting rectified areas.",
    "• If an SRR involves a tree failure incident, a Tree Failure Report Form must be prepared and submitted.",
    "• Where defects fall outside the routine maintenance scope, the Contractor must prepare an estimate for works for the Service Manager's delegate to issue a Task Order within 7 days of submitting the SRR investigation report.",
    "• All SRR investigation and completion reports, along with Tree Failure Database Report Forms, must be passed to the relevant Checkers for checking within 3 days of completion of works (or 5 days for tree failure incidents).",
    "7. Checking and Auditing of SRRs",
    "• Slope Work Checker (SWC) and Vegetation Maintenance Checker (VMC) are responsible for checking and endorsing SRRs.",
    "• The SWC checks non-vegetation related SRRs, while the VMC checks vegetation-related SRRs.",
    "• Checkers perform document-checks on all investigation and completion reports for proper preparation, sufficiency of photos, complainant replies, and satisfactory completion of works.",
    "• Non-complying reports are returned for correction, with a deadline of not more than 2 days for rectification and resubmission.",
    "• The Service Manager's delegates will randomly select a percentage of completed SRR reports for site-checks by the Checkers:",
    "◦ At least 30% of non-VMI&VMO related SRR completion reports.",
    "◦ At least 10% of VMI&VMO related SRR completion reports.",
    "• Checkers must complete site-checks within 7 working days of notification. They attach a Certificate of Checking to each site-check report and submit it to the Service Manager's delegate for auditing.",
    "8. Payments and Deductions",
    "• The Contractor conducts preliminary inspections and reports on SRRs at their own cost, and generally, no compensation event will arise even if the reported defect is outside the ArchSD Slope or cannot be found.",
    "• However, if rectification of defects is required that falls outside the defined scope of routine maintenance (Clause 4.3.2, 6.3.1, or 7.3.2), a Task Order will be issued.",
    "• Default Notices (DN) can be issued for:",
    "◦ Late, wrong, or unsatisfactory submission of SRR reports.",
    "◦ Inability to demonstrate that a complaint case was properly/timely handled, especially if it leads to recurrent SRR cases.",
    "◦ Failure to immediately report to the Service Manager any defects posing imminent danger to property or person identified during SRRI, if reported by others or observed during audits.",
    "9. Tools and Equipment for Emergency SRRs",
    "• When handling emergency SRRs, the Contractor should utilise the plant and facilities specified in Clause 9 of the Services Requirement for temporary measures, such as re-erecting temporary fences or covering exposed slope surfaces. These include mechanical drain blockage clearing equipment.",
    "• For Out of Normal Working Hours Emergencies, the emergency team must be equipped with necessary materials, plant, and equipment."
  ],
  "paragraphs": 64,
  "source": "SRR rules.docx"
}